       program-id. Serie3Ex2 as "Serie3Ex2".

       environment division.
       configuration section.
       input-output section.
           file-control
       data division.
       working-storage section.
       

       procedure division.


           goback.

       end program Serie3Ex2.
